public class Recursive {
    /**
     * Цей метод реалізує рекурсивний пошук числа Фібоначчі
     * Сумарна часова складність - T(n-1) + T(n-2) + O(1),
     * де O(1) - константний час, який потрібен для порівнянь та арифметичних операцій,
     * T(n-1)+T(n-2) - часова складність для виклику recursiveFib(int n)
     * Просторова складність - O(n^2) - оскільки рекурсивна функція викликає себе двічі для кожного значення n
     *
     * Доречний тип UML діаграми: діаграма діяльностей
     */
    public static long recursiveFib(int n){
        if(n<=1){
            return n;
        }
        return recursiveFib(n-1) + recursiveFib(n-2);
    }
}
